import { Component, signal } from '@angular/core';

@Component({
  selector: 'app-root',
  imports: [],
  templateUrl: './app.html',
  styleUrl: './app.css',
})

export class App {
  searchOpen = false;
  toggleSearch() {
    this.searchOpen = !this.searchOpen;
  }
  protected readonly title = signal('NKWallix Storyhub');

  constructor() {
  console.log(`

██╗  ██╗██╗   ██╗██████╗  ██████╗ ███████╗
╚██╗██╔╝╚██╗ ██╔╝██╔══██╗██╔═══██╗██╔════╝
 ╚███╔╝  ╚████╔╝ ██████╔╝██║   ██║███████╗
 ██╔██╗   ╚██╔╝  ██╔══██╗██║   ██║╚════██║
██╔╝ ██╗   ██║   ██║  ██║╚██████╔╝███████║
╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚══════╝
            
            W A T C H E S

      NKWALLIX STORYHUB™

`);
}
}
